from src.services import get_operations_tel_num

data = [
    {
        "Дата операции": "28.01.2018 23:09:43",
        "Дата платежа": "30.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -2789.68,
        "Валюта операции": "RUB",
        "Сумма платежа": -2789.68,
        "Валюта платежа": "RUB",
        "Кэшбэк": "",
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Перекрёсток",
        "Бонусы (включая кэшбэк)": 55,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 2789.68,
    },
    {
        "Дата операции": "18.11.2021 21:15:27",
        "Дата платежа": "19.11.2021",
        "Номер карты": "",
        "Статус": "OK",
        "Сумма операции": -200.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -200.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "",
        "Категория": "Мобильная связь",
        "MCC": "",
        "Описание": "Тинькофф Мобайл +7 995 555-55-55",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 200.0,
    },
]


def test_get_operations_tel_num():
    assert get_operations_tel_num(data) == [
        {
            "Дата операции": "18.11.2021 21:15:27",
            "Дата платежа": "19.11.2021",
            "Номер карты": "",
            "Статус": "OK",
            "Сумма операции": -200.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -200.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Мобильная связь",
            "MCC": "",
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 200.0,
        }
    ]
